# 1. Create DataFrame

In [1]:
maths = c(89,78,56,90,92,95)
science <- c(83,89,80,96,91,76)
first_name <- c('first1','first2','first3','first4','first5','first6')
last_name <- c('last1','last2','last3','last4','last5','last6')
student_id <- c(1,2,3,4,5,6)

In [2]:
class_total <- data.frame(student_id,first_name,last_name,maths, science)

In [3]:
class_total

  student_id first_name last_name maths science
1 1          first1     last1     89    83
2 2          first2     last2     78    89
3 3          first3     last3     56    80
4 4          first4     last4     90    96
5 5          first5     last5     92    91
6 6          first6     last6     95    76

## 2. Concatenate Dataframe columns from vector

In [4]:
# concatenates DataFrame columns
class_total <- cbind(class_total, maths, science)

In [5]:
class_total

  student_id first_name last_name maths science maths science
1 1          first1     last1     89    83      89    83
2 2          first2     last2     78    89      78    89
3 3          first3     last3     56    80      56    80
4 4          first4     last4     90    96      90    96
5 5          first5     last5     92    91      92    91
6 6          first6     last6     95    76      95    76

# 3. Merge

In [6]:
student_id <- c(3,4,6,2,1,5)
history <- c(56,76,68,86,45,49)
english <- c(66,55,88,77,61,64)

In [7]:
class3 <- data.frame(student_id,history,english, stringsAsFactors = F)
class3

  student_id history english
1 3          56      66
2 4          76      55
3 6          68      88
4 2          86      77
5 1          45      61
6 5          49      64

In [8]:
student_id <- c(3,1,6, 9)
scores <- c(56,76,68, 100)
exam_ext <- data.frame(student_id,scores)
exam_ext

  student_id scores
1 3           56
2 1           76
3 6           68
4 9          100

### 3.1 Merge

In [9]:
class_total_m <- merge(class_total, class3, by='student_id')
class_total_m

Warning message in merge.data.frame(class_total, class3, by = "student_id"):
"column names 'maths', 'science' are duplicated in the result"

  student_id first_name last_name maths science maths science history english
1 1          first1     last1     89    83      89    83      45      61
2 2          first2     last2     78    89      78    89      86      77
3 3          first3     last3     56    80      56    80      56      66
4 4          first4     last4     90    96      90    96      76      55
5 5          first5     last5     92    91      92    91      49      64
6 6          first6     last6     95    76      95    76      68      88

### 3.2 Left Merge

In [10]:
class_total_l <- merge(class_total, class3, by='student_id', all.x = TRUE)
class_total_l

Warning message in merge.data.frame(class_total, class3, by = "student_id", all.x = TRUE):
"column names 'maths', 'science' are duplicated in the result"

  student_id first_name last_name maths science maths science history english
1 1          first1     last1     89    83      89    83      45      61
2 2          first2     last2     78    89      78    89      86      77
3 3          first3     last3     56    80      56    80      56      66
4 4          first4     last4     90    96      90    96      76      55
5 5          first5     last5     92    91      92    91      49      64
6 6          first6     last6     95    76      95    76      68      88

### 3.3 Right Merge

In [11]:
class_total_r <- merge(class_total, exam_ext, by='student_id', all.y=TRUE)
class_total_r

Warning message in merge.data.frame(class_total, exam_ext, by = "student_id", all.y = TRUE):
"column names 'maths', 'science' are duplicated in the result"

  student_id first_name last_name maths science maths science scores
1 1          first1     last1     89    83      89    83       76
2 3          first3     last3     56    80      56    80       56
3 6          first6     last6     95    76      95    76       68
4 9          NA         NA        NA    NA      NA    NA      100

### 3.4 Full Merge

In [12]:
class_total_f <- merge(class_total, exam_ext, by='student_id', all.x = TRUE, all.y=TRUE)
class_total_f

Warning message in merge.data.frame(class_total, exam_ext, by = "student_id", all.x = TRUE, :
"column names 'maths', 'science' are duplicated in the result"

  student_id first_name last_name maths science maths science scores
1 1          first1     last1     89    83      89    83       76
2 2          first2     last2     78    89      78    89       NA
3 3          first3     last3     56    80      56    80       56
4 4          first4     last4     90    96      90    96       NA
5 5          first5     last5     92    91      92    91       NA
6 6          first6     last6     95    76      95    76       68
7 9          NA         NA        NA    NA      NA    NA      100

# 4. Read from Files as DataFrame

In [1]:
getwd()

[1] "E:/PG Data Science/Live Class Materials/03. Data Science with R/Data from Teacher"

### 4.1 Read from Excel

In [2]:
library(readxl)

In [3]:
df <- read_excel('Demo_Excel.xlsx')

In [4]:
head(df, 2)

  age job        marital education default housing loan contact  month day
1 30  unemployed married primary   no      no      no   cellular oct   19
2 33  services   married secondary no      yes     yes  cellular may   11
  duration campaign pdays previous poutcome
1  79      1         -1   0        unknown
2 220      1        339   4        failure

### 4.2 Read from Tab Separated File

In [5]:
df_tab <- read.table('table_data.txt', header = TRUE)
head(df_tab)

  id name
1 1  fname1
2 2  fname2
3 3  fname3
4 4  fname4
5 5  fname5

### 4.3 Read from csv file

In [6]:
cars <- read.csv('USA_cars_datasets.csv')
head(cars,2)

  ï.. price brand  model   year title_status  mileage color  vin
1 0   6300  toyota cruiser 2008 clean vehicle 274117  black  jtezu11f88k007763
2 1   2899  ford   se      2011 clean vehicle 190552  silver 2fmdk3gc4bbb02217
  lot       state      country condition
1 159348797 new jersey usa     10 days left
2 166951262 tennessee  usa     6 days left

In [12]:
# Read without Factors
cars <- read.csv('USA_cars_datasets.csv', stringsAsFactors = F)
head(cars, 4)

  ï.. price brand  model   year title_status  mileage color  vin
1 0    6300 toyota cruiser 2008 clean vehicle 274117  black  jtezu11f88k007763
2 1    2899 ford   se      2011 clean vehicle 190552  silver 2fmdk3gc4bbb02217
3 2    5350 dodge  mpv     2018 clean vehicle  39590  silver 3c4pdcgg5jt346413
4 3   25000 ford   door    2014 clean vehicle  64146  blue   1ftfw1et4efc23745
  lot       state      country condition
1 159348797 new jersey usa     10 days left
2 166951262 tennessee  usa     6 days left
3 167655728 georgia    usa     2 days left
4 167753855 virginia   usa     22 hours left

# 5. Builtin Functions of DataFrame

### 5.1 DataFrame viewing functions

- Head
- Tail
- Dimensions
- Structure

In [28]:
head(cars)   # Show First 6 rows of data
tail(cars)   # Show Last 6 rows of data
dim(cars)    # Rows and Columns count
str(cars)    # Structure of DataFrame

  ï.. price brand     model   year title_status  mileage color
1 0    6300 toyota    cruiser 2008 clean vehicle 274117  black
2 1    2899 ford      se      2011 clean vehicle 190552  silver
3 2    5350 dodge     mpv     2018 clean vehicle  39590  silver
4 3   25000 ford      door    2014 clean vehicle  64146  blue
5 4   27700 chevrolet 1500    2018 clean vehicle   6654  red
6 5    5700 dodge     mpv     2018 clean vehicle  45561  white
  vin               lot       state      country condition
1 jtezu11f88k007763 159348797 new jersey usa     10 days left
2 2fmdk3gc4bbb02217 166951262 tennessee  usa     6 days left
3 3c4pdcgg5jt346413 167655728 georgia    usa     2 days left
4 1ftfw1et4efc23745 167753855 virginia   usa     22 hours left
5 3gcpcrec2jg473991 167763266 florida    usa     22 hours left
6 2c4rdgeg9jr237989 167655771 texas      usa     2 days left

     ï..  price brand  model year title_status  mileage color
2494 2493 9200  nissan versa 2018 clean vehicle 33027   black
2495 2494 7800  nissan versa 2019 clean vehicle 23609   red
2496 2495 9200  nissan versa 2018 clean vehicle 34553   silver
2497 2496 9200  nissan versa 2018 clean vehicle 31594   silver
2498 2497 9200  nissan versa 2018 clean vehicle 32557   black
2499 2498 9200  nissan versa 2018 clean vehicle 31371   silver
     vin               lot       state      country condition
2494 3n1cn7ap0jl883768 167762224 florida    usa     21 hours left
2495 3n1cn7ap9kl880319 167722715 california usa     1 days left
2496 3n1cn7ap5jl884088 167762225 florida    usa     21 hours left
2497 3n1cn7ap9jl884191 167762226 florida    usa     21 hours left
2498 3n1cn7ap3jl883263 167762227 florida    usa     2 days left
2499 3n1cn7ap4jl884311 167762228 florida    usa     21 hours left

[1] 2499   13

'data.frame':	2499 obs. of  13 variables:
 $ ï..         : int  0 1 2 3 4 5 6 7 8 9 ...
 $ price       : int  6300 2899 5350 25000 27700 5700 7300 13350 14600 5250 ...
 $ brand       : Factor w/ 28 levels "acura","audi",..: 28 9 8 9 6 8 6 10 6 9 ...
 $ model       : Factor w/ 127 levels "1500","2500",..: 26 93 76 33 1 76 87 33 72 76 ...
 $ year        : int  2008 2011 2018 2014 2018 2018 2010 2017 2018 2017 ...
 $ title_status: Factor w/ 2 levels "clean vehicle",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ mileage     : int  274117 190552 39590 64146 6654 45561 149050 23525 9371 63418 ...
 $ color       : Factor w/ 49 levels "beige","billet silver metallic clearcoat",..: 3 40 40 5 35 47 3 16 40 3 ...
 $ vin         : Factor w/ 2495 levels "19uua96529a004646",..: 2393 1666 1886 968 2088 1650 1194 1239 1123 1706 ...
 $ lot         : int  159348797 166951262 167655728 167753855 167763266 167655771 167753872 167692494 167763267 167656121 ...
 $ state       : Factor w/ 44 levels "alabama","arizona",..: 25 36 8 40 7 37 8 4 7 37 ...
 $ country     : Factor w/ 2 levels "canada","usa": 2 2 2 2 2 2 2 2 2 2 ...
 $ condition   : Factor w/ 47 levels "1 days left",..: 4 40 17 21 21 17 21 19 21 17 ...

### 5.2 Rename Column

In [14]:
# Get Column names and Modify Columns names
names(cars)  # Column Names
names(cars)[1] <- 'Index'   # Rename a column Name
names(cars)

 [1] "ï.."          "price"        "brand"        "model"        "year"
 [6] "title_status" "mileage"      "color"        "vin"          "lot"
[11] "state"        "country"      "condition"

 [1] "Index"        "price"        "brand"        "model"        "year"
 [6] "title_status" "mileage"      "color"        "vin"          "lot"
[11] "state"        "country"      "condition"

### 5.3 Indexing a DataFrame

In [16]:
cars[, c(1,4,5)]
cars[, c('Index','model','year')]
cars[10:20, c('Index','model','year')]

### 5.4 Filter Condition on DataFrame
- Extract all rows where brand = Chevrolet or Mazda

In [35]:
chev <- subset(cars, brand == 'chevrolet')
head(chev)

   Index price brand     model  year title_status  mileage color
5   4    27700 chevrolet 1500   2018 clean vehicle   6654  red
7   6     7300 chevrolet pk     2010 clean vehicle 149050  black
9   8    14600 chevrolet malibu 2018 clean vehicle   9371  silver
13 12    31900 chevrolet 1500   2018 clean vehicle  22909  black
23 22    15000 chevrolet door   2015 clean vehicle  61578  black
33 32    29800 chevrolet camaro 1973 clean vehicle  46226  red
   vin               lot       state        country condition
5  3gcpcrec2jg473991 167763266 florida      usa     22 hours left
7  1gcsksea1az121133 167753872 georgia      usa     22 hours left
9  1g1zd5st5jf191860 167763267 florida      usa     22 hours left
13 3gcukrec0jg176059 167763273 tennessee    usa     22 hours left
23 2gnflhe33f6214023 167763280 ohio         usa     2 days left
33 1q87t3n166389     167763370 pennsylvania usa     22 hours left

In [17]:
mazda <- subset(cars, brand == 'mazda')

In [18]:
chev_sel <- subset(cars[, c('Index','model','year')], cars$brand == 'chevrolet')

chev_sel2 <- subset(cars, brand == 'chevrolet')[, c('Index','model','year')]

chev_sel3 <- subset(cars[10:20, c('Index','model','year', 'brand')], brand == 'chevrolet')

### 5.5 Extract the brand which has the highest price

In [22]:
cars[order(-cars$price), ][1, c('brand','price')]

## OR
# which.max(column) returns index of column max value
cars[which.max(cars$price), c('brand','price')]

    brand         price
503 mercedes-benz 84900

    brand         price
503 mercedes-benz 84900

### 5.6 Extract the brand which has the 2nd Most expensive

In [23]:
cars[order(-cars$price),][2,c('brand','price')]

     brand price
1341 ford  74000

### 5.7 Unique Values

In [24]:
unique(cars$brand)
length(unique(cars$brand))

 [1] "toyota"          "ford"            "dodge"           "chevrolet"
 [5] "gmc"             "chrysler"        "kia"             "buick"
 [9] "infiniti"        "mercedes-benz"   "jeep"            "bmw"
[13] "cadillac"        "hyundai"         "mazda"           "honda"
[17] "heartland"       "jaguar"          "acura"           "harley-davidson"
[21] "audi"            "lincoln"         "lexus"           "nissan"
[25] "land"            "maserati"        "peterbilt"       "ram"

[1] 28

### 5.8 Number of Items in a Column with filer condition

In [25]:
length(subset(cars, brand == 'ford'))

[1] 13

### 5.9 Groupby

In [58]:
# FUN can be sum, mean, count
grouped_sum <- aggregate(cars$price, by = list(cars$brand), FUN = sum)
grouped_sum

   Group.1         x
1  acura              21800
2  audi               55925
3  bmw               448750
4  buick             256305
5  cadillac          249410
6  chevrolet        5544976
7  chrysler          246350
8  dodge            7681819
9  ford            26758607
10 gmc               447610
11 harley-davidson    54680
12 heartland          14830
13 honda              73530
14 hyundai            78048
15 infiniti          157180
16 jaguar              2800
17 jeep              328015
18 kia               144610
19 land              115600
20 lexus              66440
21 lincoln            36300
22 maserati           30300
23 mazda              16000
24 mercedes-benz     287040
25 nissan           3764536
26 peterbilt           1600
27 ram                11050
28 toyota              6300

### 5.10 Apply functions in DataFrame

In [59]:
sapply(list(cars$price), max)
sapply(list(cars$price), summary)

[1] 84900

        [,1]
Min.        0.00
1st Qu. 10200.00
Median  16900.00
Mean    18767.67
3rd Qu. 25555.50
Max.    84900.00

# 6. DPLYR Functions of DataFrame

In [26]:
library(dplyr)

Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

### 6.1 Filter Condition on DataFrame

In [90]:
filter(cars, brand == 'dodge')
filter(cars, brand == 'dodge')[, c('model','brand')]
filter(cars, brand == 'dodge', model == 'mpv')          # And Condition
filter(cars, brand == 'dodge' | brand == 'chevrolet')   # OR Condition

### 6.2 Sort Data

In [91]:
arrange(cars, price)
arrange(cars, desc(price))
arrange(cars, desc(price), desc(mileage))

### 6.3 Select Function

In [72]:
select(cars, c('model','brand'))
select(cars, 1:4)
select(cars, 'Index':'model')
select(arrange(cars, desc(price), desc(mileage)), c('model','brand', 'price', 'mileage'))

### 6.4 Distinct Function

In [75]:
distinct(cars, brand)  # Output is a dataFrame
unique(cars$brand)     # Output is a vector

arrange(distinct(cars, brand, model), brand, model)  # Sort Unique Data

In [76]:
class(arrange(distinct(cars, brand, model), brand, model))
dim(arrange(distinct(cars, brand, model), brand, model))

[1] "data.frame"

[1] 180   2

### 6.5 Mutate Function 
- used to create derived column

In [81]:
cars <- mutate(cars, brand_model = paste(brand, '_', model))
head(cars,2)

  Index price brand  model   year title_status  mileage color
1 0     6300  toyota cruiser 2008 clean vehicle 274117  black
2 1     2899  ford   se      2011 clean vehicle 190552  silver
  vin               lot       state      country condition    brand_model
1 jtezu11f88k007763 159348797 new jersey usa     10 days left toyota _ cruiser
2 2fmdk3gc4bbb02217 166951262 tennessee  usa     6 days left  ford _ se

### 6.6 Summarize & Groupby Functions

In [27]:
summarise(group_by(cars, brand), mean(price, na.rm = TRUE))
summarise(group_by(cars, brand), sum(price, na.rm = TRUE))

   brand           mean(price, na.rm = TRUE)
1  acura            7266.667
2  audi            13981.250
3  bmw             26397.059
4  buick           19715.769
5  cadillac        24941.000
6  chevrolet       18669.953
7  chrysler        13686.111
8  dodge           17781.988
9  ford            21666.888
10 gmc             10657.381
11 harley-davidson 54680.000
12 heartland        2966.000
13 honda            6127.500
14 hyundai          5203.200
15 infiniti        13098.333
16 jaguar           2800.000
17 jeep            10933.833
18 kia             11123.846
19 land            28900.000
20 lexus           33220.000
21 lincoln         18150.000
22 maserati        30300.000
23 mazda            8000.000
24 mercedes-benz   28704.000
25 nissan          12065.821
26 peterbilt         400.000
27 ram             11050.000
28 toyota           6300.000

   brand           sum(price, na.rm = TRUE)
1  acura              21800
2  audi               55925
3  bmw               448750
4  buick             256305
5  cadillac          249410
6  chevrolet        5544976
7  chrysler          246350
8  dodge            7681819
9  ford            26758607
10 gmc               447610
11 harley-davidson    54680
12 heartland          14830
13 honda              73530
14 hyundai            78048
15 infiniti          157180
16 jaguar              2800
17 jeep              328015
18 kia               144610
19 land              115600
20 lexus              66440
21 lincoln            36300
22 maserati           30300
23 mazda              16000
24 mercedes-benz     287040
25 nissan           3764536
26 peterbilt           1600
27 ram                11050
28 toyota              6300

In [28]:
brand_groups <- group_by(cars, brand, model)
summarise(brand_groups, mean(price, na.rm = TRUE))
summarise(brand_groups, sum(price, na.rm = TRUE))

    brand         model      mean(price, na.rm = TRUE)
1   acura         door        2450.000
2   acura         mdx        16900.000
3   audi          5          36400.000
4   audi          door          12.500
5   audi          q5         19500.000
6   bmw           coupe       1825.000
7   bmw           door        9725.000
8   bmw           m          53500.000
9   bmw           series     36962.500
10  bmw           x3         24550.000
11  buick         door       18575.625
12  buick         enclave    32250.000
13  buick         encore     14400.000
14  cadillac      coupe          0.000
15  cadillac      door       26701.333
16  cadillac      esv        33300.000
17  cadillac      srx        18402.000
18  cadillac      xt5        37500.000
19  chevrolet     1500       26706.316
20  chevrolet     2500       31612.750
21  chevrolet     3500       38325.000
22  chevrolet     cab        10440.000
23  chevrolet     camaro     25916.667
24  chevrolet     colorado   19642.833
25  chevrolet     corvette   52025.000
26  chevrolet     coupe       2306.667
27  chevrolet     cruze       6000.000
28  chevrolet     cutaway    16100.000
29  chevrolet     door       12314.212
30  chevrolet     equinox    15438.889
... ...           ...        ...
151 mercedes-benz glc        24900.000
152 mercedes-benz gle        34000.000
153 mercedes-benz sl-class   84900.000
154 mercedes-benz vans       16600.000
155 nissan        altima     13923.810
156 nissan        armada     25825.000
157 nissan        cab         8350.000
158 nissan        cargo      19000.000
159 nissan        door        6329.184
160 nissan        doors       5810.524
161 nissan        frontier   18107.143
162 nissan        juke        8400.000
163 nissan        kicks      15300.000
164 nissan        maxima     15900.000
165 nissan        mpv         4755.000
166 nissan        murano     20765.000
167 nissan        note        6050.000
168 nissan        nvp        22700.000
169 nissan        pathfinder 18622.727
170 nissan        rogue      15094.444
171 nissan        sedan       7825.000
172 nissan        sentra      9573.214
173 nissan        sport      12477.027
174 nissan        titan      24120.000
175 nissan        versa       8438.235
176 nissan        xd         36300.000
177 nissan        xterra      6700.000
178 peterbilt     truck        400.000
179 ram           door       11050.000
180 toyota        cruiser     6300.000

    brand         model      sum(price, na.rm = TRUE)
1   acura         door          4900
2   acura         mdx          16900
3   audi          5            36400
4   audi          door            25
5   audi          q5           19500
6   bmw           coupe         1825
7   bmw           door         48625
8   bmw           m            53500
9   bmw           series      295700
10  bmw           x3           49100
11  buick         door        148605
12  buick         enclave      64500
13  buick         encore       43200
14  cadillac      coupe            0
15  cadillac      door        160208
16  cadillac      esv          33300
17  cadillac      srx          18402
18  cadillac      xt5          37500
19  chevrolet     1500       1014840
20  chevrolet     2500        252902
21  chevrolet     3500        153300
22  chevrolet     cab          10440
23  chevrolet     camaro      155500
24  chevrolet     colorado    235714
25  chevrolet     corvette    208100
26  chevrolet     coupe         6920
27  chevrolet     cruze        12000
28  chevrolet     cutaway      32200
29  chevrolet     door       1219107
30  chevrolet     equinox     277900
... ...           ...        ...
151 mercedes-benz glc         24900
152 mercedes-benz gle         68000
153 mercedes-benz sl-class    84900
154 mercedes-benz vans        33200
155 nissan        altima     292400
156 nissan        armada     103300
157 nissan        cab          8350
158 nissan        cargo       19000
159 nissan        door       310130
160 nissan        doors      122021
161 nissan        frontier   253500
162 nissan        juke         8400
163 nissan        kicks       15300
164 nissan        maxima      47700
165 nissan        mpv          9510
166 nissan        murano     103825
167 nissan        note        12100
168 nissan        nvp         22700
169 nissan        pathfinder 409700
170 nissan        rogue      815100
171 nissan        sedan       31300
172 nissan        sentra     268050
173 nissan        sport      461650
174 nissan        titan      120600
175 nissan        versa      286900
176 nissan        xd          36300
177 nissan        xterra       6700
178 peterbilt     truck        1600
179 ram           door        11050
180 toyota        cruiser      6300